Tsung Results/Test23-Monster-20151120-0108/simple.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="noteit-aviral-passenger-mem-1804245803.us-east-1.elb.amazonaws.com" port="80" type="tcp"/>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
   <arrivalphase phase="4" duration="30" unit="second">
     <users arrivalrate="8" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="5" duration="30" unit="second">
     <users arrivalrate="16" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="6" duration="35" unit="second">
     <users arrivalrate="20" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="7" duration="35" unit="second">
     <users arrivalrate="40" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="8" duration="35" unit="second">
     <users arrivalrate="80" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="9" duration="35" unit="second">
     <users arrivalrate="100" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="10" duration="35" unit="second">
     <users arrivalrate="120" unit="second"/>
   </arrivalphase>
    <arrivalphase phase="11" duration="35" unit="second">
     <users arrivalrate="240" unit="second"/>
   </arrivalphase>
    <arrivalphase phase="12" duration="35" unit="second">
     <users arrivalrate="480" unit="second"/>
   </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="probable-note-creator-navigation" probability="30" type="ts_http">

      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <setdynvars sourcetype="random_number" start="1" end="500">
        <var name="username"/>
      </setdynvars>

      <request>
        
        <http url="/users/sign_in" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/users/sign_in" version="1.1" method="POST" contents="utf8=%E2%9C%93&amp;user%5Bemail%5D=niu%40gmail.com&amp;user%5Bpassword%5D=12345678&amp;user%5Bremember_me%5D=0&amp;commit=Log+in">
        </http>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http url="/notes/new" version="1.1" method="GET"/>
      </request>
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="random_title"/>
        <var name="random_content"/>
      </setdynvars>

      <thinktime value="2" random="true"/>

      <request>
        
        <http url="/notes" version="1.1" method="GET"/>
      </request>

      <thinktime value="20" random="true"/>      

     <request subst="true">
                  <http url="/search" version="1.1" method="POST" contents="utf8=%E2%9C%93&amp;search=&amp;commit=Search"/>
      </request>

      <setdynvars sourcetype="random_number" start="1" end="10">
        <var name="random_note_number"/>
      </setdynvars>
      
      <request subst="true">
        
        <http url="/notes/%%_random_note_number%%" version="1.1" method="GET"/>
      </request>
      
     <request subst="true">
                  <http url="/comments" version="1.1" method="POST" contents="utf8=%E2%9C%93&amp;note_id=%%_random_note_number%%&amp;comment%5Bcontent%5D=hello&amp;commit=Post+comment"/>
       
      </request>

      <request>
        <http url="/static_pages/home" version="1.1" method="GET"/>
      </request>

    <request>
               <http url="/users/sign_out" version="1.1" method="POST" contents="_method=delete&amp;"/>
     </request> 


    </session>
   
    <session name="probable-user-navigation-1" probability="30" type="ts_http">

      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <setdynvars sourcetype="random_number" start="1" end="30">
        <var name="username"/>
      </setdynvars>

             
      <request subst="true">
        <http url="/search" version="1.1" method="POST" contents="utf8=%E2%9C%93&amp;search=&amp;commit=Search"/>
      </request>
      <thinktime value="2" random="true"/>

      <setdynvars sourcetype="random_number" start="1" end="10">
        <var name="random_note_number"/>
      </setdynvars>
      
      <request subst="true">
        <http url="/notes/%%_random_note_number%%" version="1.1" method="GET"/>
      </request>
    
    </session>

    <session name="probable-user-navigation-2" probability="40" type="ts_http">
      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>
      <thinktime value="2" random="true"/>
      <request>
        <http url="/users/sign_up" version="1.1" method="GET"/>
      </request>
      <setdynvars sourcetype="random_number" start="1000" end="9999999">
        <var name="random_user_name"/>
      </setdynvars>
      <thinktime value="3" random="true"/>
      <request subst="true">
         <http url="/users" version="1.1" method="POST" contents="utf8=%E2%9C%93&amp;user%5Bemail%5D=new_user%%_random_user_name%%%40yahoo.com&amp;user%5Bpassword%5D=11111111&amp;user%5Bpassword_confirmation%5D=11111111"/>
      </request>
      <thinktime value="2" random="true"/>
      <request subst="true">
        <http url="/search" version="1.1" method="POST" contents="utf8=%E2%9C%93&amp;search=&amp;commit=Search"/>
      </request>
      <thinktime value="3" random="true"/>
      <setdynvars sourcetype="random_number" start="1" end="10">
        <var name="random_note_number"/>
      </setdynvars>
      <request subst="true">
        <http url="/notes/%%_random_note_number%%" version="1.1" method="GET"/>
      </request>
      <thinktime value="10" random="true"/>
      <request subst="true">
        <http url="/comments" version="1.1" method="POST" contents="utf8=%E2%9C%93&amp;note_id=%%_random_note_number%%&amp;comment%5Bcontent%5D=that%27s+a+good+one%21&amp;commit=Post+comment"/>
      </request>

      <thinktime value="2" random="true"/>
      <setdynvars sourcetype="random_number" start="1" end="1000">
        <var name="notebook_random"/>
      </setdynvars>
      <request subst="true">
        <http url="/notebooks" version="1.1" method="POST" contents="utf8=%E2%9C%93&amp;notebook%5Btitle%5D=my+first+note+book%21+%%_notebook_random%%&amp;commit=Create"/>
      </request>

      <thinktime value="2" random="true"/>
      <request subst="true">        
        <http url="/notes/new" version="1.1" method="GET"/>
      </request>
      
      <request>
        <http url="/users/sign_out" version="1.1" method="POST" contents="_method=delete&amp;"/>
     </request> 


    </session>

  </sessions>
</tsung>